<a href="https://colab.research.google.com/github/nehalmohamed2/Python-Practice/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#Pandas :is a powerful Python library used for data manipulation and analysis. It provides data structures like Series (one-dimensional=one coulme)
#and DataFrame (two-dimensional =alot of coulme table) to efficiently handle and analyze structured data
#Data Loading: Read and write data from CSV, Excel, SQL, JSON, etc.
#Data Cleaning: Handle missing values, duplicate data, and data transformation
#Data Analysis: Aggregation, filtering, grouping, and statistical analysis
#Data Visualization: Integration with Matplotlib and Seaborn for plotting.

In [ ]:
import pandas as pd
x= pd.Series([1,2,3,4])
x

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
#pandas جواه Numpy

In [ ]:
import pandas as pd
y= pd.Series(['nehal','mohammed','ahmed'])
y

0       nehal
1    mohammed
2       ahmed
dtype: object

In [ ]:
y.values #----returen values array

array(['nehal', 'mohammed', 'ahmed'], dtype=object)

In [ ]:
y.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
obj=pd.Series([1,2,3],index=['a','b','c'])
obj

a    1
b    2
c    3
dtype: int64

In [ ]:
score= {'nehal':90,'mohammed':80, 'ahmed':60} #dactionary -----Key=index:value
score

name=pd.Series(score)
name

nehal       90
mohammed    80
ahmed       60
dtype: int64

In [ ]:
name[name>80]

nehal    90
dtype: int64

In [ ]:
[name>80]

[nehal        True
 mohammed    False
 ahmed       False
 dtype: bool]

In [21]:
import pandas as pd

student_dict = {
    'Name': ['mohamed', 'nehal', 'ahmed'],  # تم تغيير () إلى []
    'Age': [30, 40, 20],
    'Grade': [98, 50, 80]
}

student_DF = pd.DataFrame(student_dict)
print(student_DF)

      Name  Age  Grade
0  mohamed   30     98
1    nehal   40     50
2    ahmed   20     80